In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [16]:
pwd   # for Location

'C:\\Users\\Nitro'

In [34]:
import pandas as pd
df=pd.read_csv('data.csv',nrows=5)
df

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864
3  Nabin   67      Jhapa  9808667654
4   Sita   34  Kathmandu  9870667624

In [28]:
df=pd.read_csv('data.csv',nrows=5)
df.head(3)

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864

In [30]:
df=pd.read_csv('data.csv',nrows=5)
df.tail(3)

    name  age        add       phone
2   Hari   45  Bhaktapur  9808667864
3  Nabin   67      Jhapa  9808667654
4   Sita   34  Kathmandu  9870667624

In [45]:
row,col =df.shape
print(row)
col

5

4

In [51]:
df=pd.read_csv('data.csv',usecols=['name','phone'])
df

    name       phone
0    Ram  9808774567
1  Shyam  9808334678
2   Hari  9808667864
3  Nabin  9808667654
4   Sita  9870667624
5   Soni  9808334894

In [63]:
df=pd.read_csv('data.csv')
df[['phone','name']]

        phone   name
0  9808774567    Ram
1  9808334678  Shyam
2  9808667864   Hari
3  9808667654  Nabin
4  9870667624   Sita
5  9808334894   Soni

In [71]:
df=pd.read_csv('data.csv')
df['phone']

0    9808774567
1    9808334678
2    9808667864
3    9808667654
4    9870667624
5    9808334894
Name: phone, dtype: int64

In [74]:
#iloc
df=pd.read_csv('data.csv')
df.iloc[0:4]

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864
3  Nabin   67      Jhapa  9808667654

In [94]:
#iloc doesdnot support in all kind if we use comma then it read coloumn
df.iloc[0:4, 0:3]

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   45   Lalitpur
2   Hari   45  Bhaktapur
3  Nabin   67      Jhapa

In [111]:
df=pd.read_csv('data.csv')
df['add'] == 'Kathmandu'

0     True
1    False
2    False
3    False
4     True
5    False
Name: add, dtype: bool

In [113]:
df=pd.read_csv('data.csv')
df[df['add'] == 'Kathmandu']

   name  age        add       phone
0   Ram   34  Kathmandu  9808774567
4  Sita   34  Kathmandu  9870667624

In [115]:
#we can use all conditional and or not etc

In [4]:
import pandas as pd
df=pd.read_csv('data.csv')
df

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864
3  Nabin   67      Jhapa  9808667654
4   Sita   34  Kathmandu  9870667624
5   Soni   22      Jhapa  9808334894

In [22]:
#saving to csv file
import pandas as pd
df=pd.read_csv('data.csv')
df=df[df['add']=='Kathmandu']
df.to_csv('filter_data.csv')
df

   name  age        add       phone
0   Ram   34  Kathmandu  9808774567
4  Sita   34  Kathmandu  9870667624

In [24]:
df.to_csv('filter_data.json')
df

   name  age        add       phone
0   Ram   34  Kathmandu  9808774567
4  Sita   34  Kathmandu  9870667624

In [30]:
import pandas as pd

df = pd.read_csv('filter_data.csv')
df

   Unnamed: 0  name  age        add       phone
0           0   Ram   34  Kathmandu  9808774567
1           4  Sita   34  Kathmandu  9870667624

In [34]:
#list inside list to csv
import csv
data=[['name','age','add'],
       ['Ram','34','Kathmandu'],
       ['Shyam','45','Bhaktapur'],
       ['Hari','45','Lalitpur']]
file=open('list_data.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [36]:
df=pd.read_csv('list_data.csv')
df

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   45  Bhaktapur
2   Hari   45   Lalitpur

In [42]:
import pandas as pd
data=[['name','age','add'],
     ['Ram','34','Kathmandu'],
     ['Shyam','45','Bhaktapur'],
     ['Hari','45','Lalitpur']]
df=pd.DataFrame(data,columns=['name','age','add'])
df.to_csv('list_data.csv')
df

    name  age        add
0   name  age        add
1    Ram   34  Kathmandu
2  Shyam   45  Bhaktapur
3   Hari   45   Lalitpur

In [7]:
#list inside dictionary
import pandas as pd
data={
    'name':['Ram','Shyam','Hari'],
    'age':['34','56','34'],
    'add':['Bhaktapur','Kathmandu','Lalitpur']
}
df=pd.DataFrame(data)
df.to_csv('list_data.csv')
df

    name age        add
0    Ram  34  Bhaktapur
1  Shyam  56  Kathmandu
2   Hari  34   Lalitpur

In [9]:
import csv
with open('data.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'name': 'Ram', 'age': '34', 'add': 'Kathmandu', 'phone': '9808774567'}
{'name': 'Shyam', 'age': '45', 'add': 'Lalitpur', 'phone': '9808334678'}
{'name': 'Hari', 'age': '45', 'add': 'Bhaktapur', 'phone': '9808667864'}
{'name': 'Nabin', 'age': '67', 'add': 'Jhapa', 'phone': '9808667654'}
{'name': 'Sita', 'age': '34', 'add': 'Kathmandu', 'phone': '9870667624'}
{'name': 'Soni', 'age': '22', 'add': 'Jhapa', 'phone': '9808334894'}

In [19]:
import csv
csvfile=open('data.csv','r')
reader=csv.DictReader(csvfile)
print([i for i in reader])

[{'name': 'Ram', 'age': '34', 'add': 'Kathmandu', 'phone': '9808774567'}, {'name': 'Shyam', 'age': '45', 'add': 'Lalitpur', 'phone': '9808334678'}, {'name': 'Hari', 'age': '45', 'add': 'Bhaktapur', 'phone': '9808667864'}, {'name': 'Nabin', 'age': '67', 'add': 'Jhapa', 'phone': '9808667654'}, {'name': 'Sita', 'age': '34', 'add': 'Kathmandu', 'phone': '9870667624'}, {'name': 'Soni', 'age': '22', 'add': 'Jhapa', 'phone': '9808334894'}]

In [31]:
#removing or dropping coloumn axis 0=row   1=coloumn
df=pd.read_csv('list_data.csv',index_col='sn')
df.drop('Unnamed:0',axis=1)

ValueError: Index sn invalid